""" Дан список чисел. Опредлите, сколько в нем 
встречается различных чисел.
[1, 1, 2, 0, -1, 3, 4, 4] """

list_1 = [1, 1, 2, 0, -1, 3, 4, 4]
print(set(list_1))
